SystemTest/TestOutputWsdl.xml

<?xml version='1.0' encoding='UTF-8'?>
<wsdl:definitions xmlns:wsa="http://schemas.xmlsoap.org/ws/2003/03/addressing" xmlns:tns="tns" xmlns:plink="http://schemas.xmlsoap.org/ws/2003/05/partner-link/" xmlns:xop="http://www.w3.org/2004/08/xop/include" xmlns:soap12env="http://www.w3.org/2003/05/soap-envelope/" xmlns:senc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:senv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap12enc="http://www.w3.org/2003/05/soap-encoding/" targetNamespace="tns" name="BgSoapService"><wsdl:types><xs:schema targetNamespace="tns" elementFormDefault="qualified"><xs:complexType name="stringArray"><xs:sequence><xs:element name="string" type="xs:string" minOccurs="0" maxOccurs="unbounded" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="reflection"><xs:sequence><xs:element name="title" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="address" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="application" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="id" type="xs:integer" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="tran"><xs:sequence><xs:element name="title" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="address" type="xs:string" minOccurs="0" nillable="true"/><xs:element name="application" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="tranResponse"><xs:sequence><xs:element name="tranResult" type="xs:string" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:complexType name="reflectionResponse"><xs:sequence><xs:element name="reflectionResult" type="tns:stringArray" minOccurs="0" nillable="true"/></xs:sequence></xs:complexType><xs:element name="stringArray" type="tns:stringArray"/><xs:element name="reflection" type="tns:reflection"/><xs:element name="tran" type="tns:tran"/><xs:element name="tranResponse" type="tns:tranResponse"/><xs:element name="reflectionResponse" type="tns:reflectionResponse"/></xs:schema></wsdl:types><wsdl:message name="tran"><wsdl:part name="tran" element="tns:tran"/></wsdl:message><wsdl:message name="tranResponse"><wsdl:part name="tranResponse" element="tns:tranResponse"/></wsdl:message><wsdl:message name="reflection"><wsdl:part name="reflection" element="tns:reflection"/></wsdl:message><wsdl:message name="reflectionResponse"><wsdl:part name="reflectionResponse" element="tns:reflectionResponse"/></wsdl:message><wsdl:service name="BgSoapService"><wsdl:port name="BgSoapService" binding="tns:BgSoapService"><soap:address location="http://localhost:5000/soap/bgservice"/></wsdl:port></wsdl:service><wsdl:portType name="BgSoapService"><wsdl:operation name="tran" parameterOrder="tran"><wsdl:input name="tran" message="tns:tran"/><wsdl:output name="tranResponse" message="tns:tranResponse"/></wsdl:operation><wsdl:operation name="reflection" parameterOrder="reflection"><wsdl:input name="reflection" message="tns:reflection"/><wsdl:output name="reflectionResponse" message="tns:reflectionResponse"/></wsdl:operation></wsdl:portType><wsdl:binding name="BgSoapService" type="tns:BgSoapService"><soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="tran"><soap:operation soapAction="tran" style="document"/><wsdl:input name="tran"><soap:body use="literal"/></wsdl:input><wsdl:output name="tranResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="reflection"><soap:operation soapAction="reflection" style="document"/><wsdl:input name="reflection"><soap:body use="literal"/></wsdl:input><wsdl:output name="reflectionResponse"><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding></wsdl:definitions>